# PROYECTO SPRINT 7: RECOPILACION DE ALMACENAMIENTO DE DATOS (SQL)

## 1.- Importacion de Bibliotecas

In [1]:
import pandas as pd
import numpy as np
from scipy import stats as st
from functools import reduce
from matplotlib import pyplot as plt
import seaborn as sns
import plotly_express as px

## 2.- Estudio de Datos.
### 2.1.- Trabajo de Datos.

In [5]:
company_trips = pd.read_csv('moved_project_sql_result_01.csv')
display(company_trips.head())
company_trips.info()
print('==============')
print()
trips_per_loc = pd.read_csv('moved_project_sql_result_04.csv')
trips_per_loc['average_trips'] = np.floor(trips_per_loc['average_trips']).astype(int)
display(trips_per_loc.head())
trips_per_loc.info()
print('==============')
print()

trip_info = pd.read_csv('moved_project_sql_result_07.csv')
trip_info['duration_minutes'] = (trip_info['duration_seconds']/60).round(2)

display(trip_info.head())
trip_info.info()

                      company_name  trips_amount
0                        Flash Cab         19558
1        Taxi Affiliation Services         11422
2                 Medallion Leasin         10367
3                       Yellow Cab          9888
4  Taxi Affiliation Service Yellow          9299

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64 entries, 0 to 63
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   company_name  64 non-null     object
 1   trips_amount  64 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.1+ KB
==============

  dropoff_location_name  average_trips
0                  Loop          10727
1           River North           9523
2         Streeterville           6664
3             West Loop           5163
4                O'Hare           2546

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 94 entries, 0 to 93
Data columns (total 2 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   dropoff_location_name  94 non-null     object
 1   average_trips          94 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.6+ KB
==============

              start_ts weather_conditions  duration_seconds  duration_minutes
0  2017-11-25 16:00:00               Good            2410.0             40.17
1  2017-11-25 14:00:00               Good            1920.0             32.00
2  2017-11-25 12:00:00               Good            1543.0             25.72
3  2017-11-04 10:00:00               Good            2512.0             41.87
4  2017-11-11 07:00:00               Good            1440.0             24.00

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1068 entries, 0 to 1067
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   start_ts            1068 non-null   object
 1   weather_conditions  1068 non-null   object
 2   duration_seconds    1068 non-null   float64
 3   duration_minutes    1068 non-null   float64
dtypes: float64(2), object(2)
memory usage: 33.5+ KB

In [3]:
print(f'El dataframe "company_trips" tiene valores ausentes?:\n{company_trips.isna().sum()}')
print()
print(f'El dataframe "trips_per_loc" tiene valores ausentes?:\n{trips_per_loc.isna().sum()}')
print()
print(f'El dataframe "trip_info" tiene valores ausentes?:\n{trip_info.isna().sum()}')

El dataframe "company_trips" tiene valores ausentes?:
company_name    0
trips_amount    0
dtype: int64

El dataframe "trips_per_loc" tiene valores ausentes?:
dropoff_location_name    0
average_trips            0
dtype: int64

El dataframe "trip_info" tiene valores ausentes?:
start_ts              0
weather_conditions    0
duration_seconds      0
duration_minutes      0
dtype: int64

## 3.- Top 10 barrios principales en terminos de Finalizacion del recorrido.